#include <iostream>
#include <Windows.h>
using namespace std;


void addition() {
    int x;
    int y;
    char c = '+';

    cout << "x? ";
    cin >> x;
    cout << "y? ";
    cin >> y;
    cout << "Calculating..{" << x << "+" << y << "}" << "\n";
    cout << "Result: {" << x + y << "}" << endl;
    
}

void multiplication() {
    int x;
    int y;
    char c = '*';

    cout << "x? ";
    cin >> x;
    cout << "y? ";
    cin >> y;
    cout << "Calculating..{" << x << "*" << y << "}" << "\n";
    cout << "Result: {" << x * y << "}" << endl;

}

void divide() {
    int x;
    int y;
    char c = '/';

    cout << "x? ";
    cin >> x;
    cout << "y? ";
    cin >> y;
    cout << "Calculating..{" << x << "/" << y << "}" << "\n";

    cout << "Result: {" << x / y << "}" << endl;
   

}

void versiontwo() {
    int x;
    int y;
    char o = '+';
    cout << "x? ";
    cin >> x;
    cout << "y? ";
    cin >> y;
    cout << "Operation? (x ? y): ";
    cout << "Calculating.." << x << o << y;
}

int main()
{   
    int a;
    int b;
    string usr;
    char c;
    SetConsoleOutputCP(CP_UTF8);
    cout << R"(+-----------------------------------------------------------------------------------------------------------+
|   ▄████████ ███    █▄     ▄███████▄    ▄████████    ▄████████  ▄████████    ▄████████  ▄█        ▄████████|
|  ███    ███ ███    ███   ███    ███   ███    ███   ███    ███ ███    ███   ███    ███ ███       ███    ███|
|  ███    █▀  ███    ███   ███    ███   ███    █▀    ███    ███ ███    █▀    ███    ███ ███       ███    █▀ |
|  ███        ███    ███   ███    ███  ▄███▄▄▄      ▄███▄▄▄▄██▀ ███          ███    ███ ███       ███       |
|▀███████████ ███    ███ ▀█████████▀  ▀▀███▀▀▀     ▀▀███▀▀▀▀▀   ███        ▀███████████ ███       ███       |
|         ███ ███    ███   ███          ███    █▄  ▀███████████ ███    █▄    ███    ███ ███       ███    █▄ |
|   ▄█    ███ ███    ███   ███          ███    ███   ███    ███ ███    ███   ███    ███ ███▌    ▄ ███    ███|
| ▄████████▀  ████████▀   ▄████▀        ██████████   ███    ███ ████████▀    ███    █▀  █████▄▄██ ████████▀ |
|                                                    ███    ███                         ▀                   |
+-----------------------------------------------------------------------------------------------------------+)" << endl;
    cout << "Welcome to the Calculator" << endl;
    Sleep(500);
    cout << "What your username?: ";
    cin >> usr;
    cout << "Hello!, " << usr << "\n";
    Sleep(500);
    cout << "What the op? (+'*'/): ";
    cin >> c;
    if (c == '+')
        addition();
    else if (c == '*')
        multiplication();
    else if (c == '/')
        divide();
	
 
}

